;Mix.regions={
    provinces:["北京", "上海", "重庆", "安徽", "福建", "甘肃", "广东", "广西", "贵州", "海南", "河北", "黑龙江", "河南",
"香港", "湖北", "湖南", "江苏", "江西", "吉林", "辽宁", "澳门", "内蒙古", "宁夏", "青海", "山东",
"山西", "陕西", "四川", "台湾", "天津", "新疆", "西藏", "云南", "浙江", "海外"],
    getCity:function(province){
var citys=[];
switch(province){
    case "安徽" :
        citys = ["合肥","安庆","蚌埠","亳州","巢湖","池州","滁州","阜阳","淮北","淮南","黄山","六安","马鞍山","宿州","铜陵","芜湖","宣城"];
        break;
    case "北京" :
        citys = ["东城",  "西城", "崇文", "宣武", "朝阳",  "丰台", "石景山", "海淀", "门头沟", "房山", "通州", "顺义", "昌平", "大兴",  "平谷",  "怀柔", "密云", "延庆"];
        break;
    case "重庆" :
        citys = ["万州", "涪陵",  "渝中",  "大渡口", "江北", "沙坪坝","九龙坡", "南岸", "北碚", "万盛", "双挢", "渝北", "巴南", "黔江",  "长寿", "綦江",  "潼南", "铜梁", "大足", "荣昌", "壁山",  "梁平", "城口", "丰都", "垫江",  "武隆", "忠县", "开县", "云阳", "奉节",  "巫山", "巫溪",  "石柱", "秀山",  "酉阳", "彭水", "江津", "合川",  "永川", "南川"];
        break;
    case "福建" :
        citys = ["福州","龙岩","南平","宁德","莆田","泉州","三明","厦门","漳州"];
        break;
    case "甘肃" :
        citys = ["兰州","白银","定西","甘南州","嘉峪关","金昌","酒泉","临夏州","陇南","平凉","庆阳","天水","武威","张掖"];
        break;
    case "广东" :
        citys = ["广州","潮州","东莞","佛山","河源","惠州","江门","揭阳","茂名","梅州","清远","汕头","汕尾","韶关","深圳","阳江","云浮","湛江","肇庆","中山","珠海"];
        break;
    case "广西" :
        citys = ["南宁","百色","北海","崇左","防城港","桂林","贵港","河池","贺州","来宾","柳州","钦州","梧州","玉林"];
        break;
    case "贵州" :
        citys = ["贵阳","安顺","毕节地区","六盘水","铜仁地区","遵义","黔西南州","黔东南州","黔南州"];
        break;
    case "海南" :
        citys = ["海口","白沙","保亭","昌江","儋州","澄迈","东方","定安","琼海","琼中","乐东","临高","陵水","三亚","屯昌","万宁","文昌","五指山"];
        break;
    case "河北" :
        citys = ["石家庄","保定","沧州","承德","邯郸","衡水","廊坊","秦皇岛","唐山","邢台","张家口"];
        break;
    case "黑龙江" :
        citys = ["哈尔滨","大庆","大兴安岭地区","鹤岗","黑河","鸡西","佳木斯","牡丹江","七台河","齐齐哈尔","双鸭山","绥化","伊春"];
        break;
    case "河南" :
        citys = ["郑州","安阳","鹤壁","焦作","开封","洛阳","漯河","南阳","平顶山","濮阳","三门峡","商丘","新乡","信阳","许昌","周口","驻马店"];
        break;
    case "香港" :
        citys = ["香港", "九龙",  "新界"];
        break;
    case "湖北" :
        citys = ["武汉","鄂州","恩施","黄冈","黄石","荆门","荆州","潜江","神农架林区","十堰","随州","天门","仙桃","咸宁","襄樊","孝感","宜昌"];
        break;
    case "湖南" :
        citys = ["长沙","常德","郴州","衡阳","怀化","娄底","邵阳","湘潭","湘西州","益阳","永州","岳阳","张家界","株洲"];
        break;
    case "江苏" :
        citys = ["南京","常州","淮安","连云港","南通","苏州","宿迁","泰州","无锡","徐州","盐城","扬州","镇江"];
        break;
    case "江西" :
        citys = ["南昌","抚州","赣州","吉安","景德镇","九江","萍乡","上饶","新余","宜春","鹰潭"];
        break;
    case "吉林" :
        citys = ["长春","白城","白山","吉林市","辽源","四平","松原","通化","延边"];
        break;
    case "辽宁" :
        citys = ["沈阳","鞍山","本溪","朝阳","大连","丹东","抚顺","阜新","葫芦岛","锦州","辽阳","盘锦","铁岭","营口"];
        break;
    case "澳门" :
        citys = ["澳门" ];
        break;
    case "内蒙古" :
        citys = ["呼和浩特","阿拉善盟","包头","巴彦淖尔","赤峰","鄂尔多斯","呼伦贝尔","通辽","乌海","乌兰察布","锡林郭勒盟","兴安盟"];
        break;
    case "宁夏" :
        citys = ["银川","固原","石嘴山","吴忠","中卫"];
        break;
    case "青海" :
        citys = ["西宁","果洛州","海东地区","海北州","海南州","海西州","黄南州","玉树州"];
        break;
    case "山东" :
        citys = ["济南","滨州","东营","德州","菏泽","济宁","莱芜","聊城","临沂","青岛","日照","泰安","威海","潍坊","烟台","枣庄","淄博"];
        break;
    case "上海" :
        citys = ["崇明",  "黄浦", "卢湾", "徐汇",  "长宁", "静安", "普陀", "闸北", "虹口", "杨浦", "闵行",  "宝山", "嘉定", "浦东", "金山",  "松江", "青浦", "南汇", "奉贤", "朱家角"];
        break;
    case "山西" :
        citys = ["太原","长治","大同","晋城","晋中","临汾","吕梁","朔州","忻州","阳泉","运城"];
        break;
    case "陕西" :
        citys = ["西安","安康","宝鸡","汉中","商洛","铜川","渭南","咸阳","延安","榆林"];
        break;
    case "四川" :
        citys = ["成都","阿坝州","巴中","达州","德阳","甘孜州","广安","广元","乐山","凉山州","泸州","南充","眉山","绵阳","内江","攀枝花","遂宁","雅安","宜宾","资阳","自贡"];
        break;
    case "台湾" :
        citys = ["台北", "基隆",  "台南", "台中",  "高雄", "屏东", "南投", "云林", "新竹", "彰化", "苗栗", "嘉义", "花莲", "桃园",  "宜兰", "台东",  "金门", "马祖", "澎湖", "其它"];
        break;
    case "天津" :
        citys = ["天津",  "和平", "东丽", "河东", "西青", "河西",  "津南",  "南开", "北辰", "河北", "武清", "红挢",  "塘沽", "汉沽", "大港",  "宁河", "静海", "宝坻", "蓟县" ];
        break;
    case "新疆" :
        citys = ["乌鲁木齐","阿拉尔","阿克苏地区","阿勒泰地区","巴音郭楞","博尔塔拉州","昌吉州","哈密地区","和田地区","喀什地区","克拉玛依","克孜勒苏州","石河子","塔城地区","图木舒克","吐鲁番地区","五家渠","伊犁州"];
        break;
    case "西藏" :
        citys = ["拉萨","阿里地区","昌都地区","林芝地区","那曲地区","日喀则地区","山南地区"];
        break;
    case "云南" :
        citys = ["昆明","保山","楚雄州","大理州","德宏州","迪庆州","红河州","丽江","临沧","怒江州","普洱","曲靖","昭通","文山","西双版纳","玉溪"];
        break;
    case "浙江" :
        citys = ["杭州","湖州","嘉兴","金华","丽水","宁波","衢州","绍兴","台州","温州","舟山"];
        break;
    case "海外" :
        citys = ["美国", "英国", "法国", "瑞士", "澳洲", "新西兰", "加拿大", "奥地利",  "韩国", "日本", "德国", "意大利", "西班牙",  "俄罗斯", "泰国", "印度",  "荷兰", "新加坡", "欧洲", "北美", "南美", "亚洲", "非洲", "大洋洲"];
        break;
    }
    return citys;
},
    getLngLat:function(prov,city){
        var cityn=prov+city
        switch(cityn){
            case '安徽马鞍山':
                return [118.515882,31.688528];
                break;
            case '辽宁朝阳':
                return [120.444715,41.594119];
                break;
            case '海南白沙':
                return [109.358586,19.216056];
                break;
            case '海南保亭':
                return [109.656113,18.597592];
                break;
            case '海南昌江':
                return [109.0113,19.222483];
                break;
            case '海南陵水':
                return [109.948661,18.575985];
                break;
            case '海南五指山':
                return [109.51775,18.831306];
                break;
            case '海南乐东':
                return [109.062698,18.658614];
                break;
            case '河南平顶山':
                return [113.300849,33.745301];
                break;
            case '云南临沧':
                return [100.092613,23.887806];
                break;
            case '云南普洱':
                return [100.980058,22.788778];
                break;
            case '黑龙江双鸭山':
                return [131.171402,46.655102];
                break;
        }
        return false;
    }
};